GopalSaraf/Practicals/PSDL/include/proc/pic16lf18444.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0711h
// bitfield definitions
PIR5_TMR1GIF_POSN                        equ 0000h
PIR5_TMR1GIF_POSITION                    equ 0000h
PIR5_TMR1GIF_SIZE                        equ 0001h
PIR5_TMR1GIF_LENGTH                      equ 0001h
PIR5_TMR1GIF_MASK                        equ 0001h
PIR5_TMR3GIF_POSN                        equ 0001h
PIR5_TMR3GIF_POSITION                    equ 0001h
PIR5_TMR3GIF_SIZE                        equ 0001h
PIR5_TMR3GIF_LENGTH                      equ 0001h
PIR5_TMR3GIF_MASK                        equ 0002h
PIR5_TMR5GIF_POSN                        equ 0002h
PIR5_TMR5GIF_POSITION                    equ 0002h
PIR5_TMR5GIF_SIZE                        equ 0001h
PIR5_TMR5GIF_LENGTH                      equ 0001h
PIR5_TMR5GIF_MASK                        equ 0004h
PIR5_CLC1IF_POSN                         equ 0004h
PIR5_CLC1IF_POSITION                     equ 0004h
PIR5_CLC1IF_SIZE                         equ 0001h
PIR5_CLC1IF_LENGTH                       equ 0001h
PIR5_CLC1IF_MASK                         equ 0010h
PIR5_CLC2IF_POSN                         equ 0005h
PIR5_CLC2IF_POSITION                     equ 0005h
PIR5_CLC2IF_SIZE                         equ 0001h
PIR5_CLC2IF_LENGTH                       equ 0001h
PIR5_CLC2IF_MASK                         equ 0020h
PIR5_CLC3IF_POSN                         equ 0006h
PIR5_CLC3IF_POSITION                     equ 0006h
PIR5_CLC3IF_SIZE                         equ 0001h
PIR5_CLC3IF_LENGTH                       equ 0001h
PIR5_CLC3IF_MASK                         equ 0040h
PIR5_CLC4IF_POSN                         equ 0007h
PIR5_CLC4IF_POSITION                     equ 0007h
PIR5_CLC4IF_SIZE                         equ 0001h
PIR5_CLC4IF_LENGTH                       equ 0001h
PIR5_CLC4IF_MASK                         equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 0712h
// bitfield definitions
PIR6_CCP1IF_POSN                         equ 0000h
PIR6_CCP1IF_POSITION                     equ 0000h
PIR6_CCP1IF_SIZE                         equ 0001h
PIR6_CCP1IF_LENGTH                       equ 0001h
PIR6_CCP1IF_MASK                         equ 0001h
PIR6_CCP2IF_POSN                         equ 0001h
PIR6_CCP2IF_POSITION                     equ 0001h
PIR6_CCP2IF_SIZE                         equ 0001h
PIR6_CCP2IF_LENGTH                       equ 0001h
PIR6_CCP2IF_MASK                         equ 0002h
PIR6_CCP3IF_POSN                         equ 0002h
PIR6_CCP3IF_POSITION                     equ 0002h
PIR6_CCP3IF_SIZE                         equ 0001h
PIR6_CCP3IF_LENGTH                       equ 0001h
PIR6_CCP3IF_MASK                         equ 0004h
PIR6_CCP4IF_POSN                         equ 0003h
PIR6_CCP4IF_POSITION                     equ 0003h
PIR6_CCP4IF_SIZE                         equ 0001h
PIR6_CCP4IF_LENGTH                       equ 0001h
PIR6_CCP4IF_MASK                         equ 0008h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 0713h
// bitfield definitions
PIR7_CWG1IF_POSN                         equ 0000h
PIR7_CWG1IF_POSITION                     equ 0000h
PIR7_CWG1IF_SIZE                         equ 0001h
PIR7_CWG1IF_LENGTH                       equ 0001h
PIR7_CWG1IF_MASK                         equ 0001h
PIR7_CWG2IF_POSN                         equ 0001h
PIR7_CWG2IF_POSITION                     equ 0001h
PIR7_CWG2IF_SIZE                         equ 0001h
PIR7_CWG2IF_LENGTH                       equ 0001h
PIR7_CWG2IF_MASK                         equ 0002h
PIR7_NCO1IF_POSN                         equ 0004h
PIR7_NCO1IF_POSITION                     equ 0004h
PIR7_NCO1IF_SIZE                         equ 0001h
PIR7_NCO1IF_LENGTH                       equ 0001h
PIR7_NCO1IF_MASK                         equ 0010h
PIR7_NVMIF_POSN                          equ 0005h
PIR7_NVMIF_POSITION                      equ 0005h
PIR7_NVMIF_SIZE                          equ 0001h
PIR7_NVMIF_LENGTH                        equ 0001h
PIR7_NVMIF_MASK                          equ 0020h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 0714h
// bitfield definitions
PIR8_SMT1IF_POSN                         equ 0000h
PIR8_SMT1IF_POSITION                     equ 0000h
PIR8_SMT1IF_SIZE                         equ 0001h
PIR8_SMT1IF_LENGTH                       equ 0001h
PIR8_SMT1IF_MASK                         equ 0001h
PIR8_SMT1PRAIF_POSN                      equ 0001h
PIR8_SMT1PRAIF_POSITION                  equ 0001h
PIR8_SMT1PRAIF_SIZE                      equ 0001h
PIR8_SMT1PRAIF_LENGTH                    equ 0001h
PIR8_SMT1PRAIF_MASK                      equ 0002h
PIR8_SMT1PWAIF_POSN                      equ 0002h
PIR8_SMT1PWAIF_POSITION                  equ 0002h
PIR8_SMT1PWAIF_SIZE                      equ 0001h
PIR8_SMT1PWAIF_LENGTH                    equ 0001h
PIR8_SMT1PWAIF_MASK                      equ 0004h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0716h
// bitfield definitions
PIE0_INTE_POSN                           equ 0000h
PIE0_INTE_POSITION                       equ 0000h
PIE0_INTE_SIZE                           equ 0001h
PIE0_INTE_LENGTH                         equ 0001h
PIE0_INTE_MASK                           equ 0001h
PIE0_IOCIE_POSN                          equ 0004h
PIE0_IOCIE_POSITION                      equ 0004h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0010h
PIE0_TMR0IE_POSN                         equ 0005h
PIE0_TMR0IE_POSITION                     equ 0005h
PIE0_TMR0IE_SIZE                         equ 0001h
PIE0_TMR0IE_LENGTH                       equ 0001h
PIE0_TMR0IE_MASK                         equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0717h
// bitfield definitions
PIE1_ADIE_POSN                           equ 0000h
PIE1_ADIE_POSITION                       equ 0000h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0001h
PIE1_ADTIE_POSN                          equ 0001h
PIE1_ADTIE_POSITION                      equ 0001h
PIE1_ADTIE_SIZE                          equ 0001h
PIE1_ADTIE_LENGTH                        equ 0001h
PIE1_ADTIE_MASK                          equ 0002h
PIE1_CSWIE_POSN                          equ 0006h
PIE1_CSWIE_POSITION                      equ 0006h
PIE1_CSWIE_SIZE                          equ 0001h
PIE1_CSWIE_LENGTH                        equ 0001h
PIE1_CSWIE_MASK                          equ 0040h
PIE1_OSFIE_POSN                          equ 0007h
PIE1_OSFIE_POSITION                      equ 0007h
PIE1_OSFIE_SIZE                          equ 0001h
PIE1_OSFIE_LENGTH                        equ 0001h
PIE1_OSFIE_MASK                          equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0718h
// bitfield definitions
PIE2_C1IE_POSN                           equ 0000h
PIE2_C1IE_POSITION                       equ 0000h
PIE2_C1IE_SIZE                           equ 0001h
PIE2_C1IE_LENGTH                         equ 0001h
PIE2_C1IE_MASK                           equ 0001h
PIE2_C2IE_POSN                           equ 0001h
PIE2_C2IE_POSITION                       equ 0001h
PIE2_C2IE_SIZE                           equ 0001h
PIE2_C2IE_LENGTH                         equ 0001h
PIE2_C2IE_MASK                           equ 0002h
PIE2_ZCDIE_POSN                          equ 0006h
PIE2_ZCDIE_POSITION                      equ 0006h
PIE2_ZCDIE_SIZE                          equ 0001h
PIE2_ZCDIE_LENGTH                        equ 0001h
PIE2_ZCDIE_MASK                          equ 0040h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0719h
// bitfield definitions
PIE3_SSP1IE_POSN                         equ 0000h
PIE3_SSP1IE_POSITION                     equ 0000h
PIE3_SSP1IE_SIZE                         equ 0001h
PIE3_SSP1IE_LENGTH                       equ 0001h
PIE3_SSP1IE_MASK                         equ 0001h
PIE3_BCL1IE_POSN                         equ 0001h
PIE3_BCL1IE_POSITION                     equ 0001h
PIE3_BCL1IE_SIZE                         equ 0001h
PIE3_BCL1IE_LENGTH                       equ 0001h
PIE3_BCL1IE_MASK                         equ 0002h
PIE3_TX1IE_POSN                          equ 0004h
PIE3_TX1IE_POSITION                      equ 0004h
PIE3_TX1IE_SIZE                          equ 0001h
PIE3_TX1IE_LENGTH                        equ 0001h
PIE3_TX1IE_MASK                          equ 0010h
PIE3_RC1IE_POSN                          equ 0005h
PIE3_RC1IE_POSITION                      equ 0005h
PIE3_RC1IE_SIZE                          equ 0001h
PIE3_RC1IE_LENGTH                        equ 0001h
PIE3_RC1IE_MASK                          equ 0020h

