GopalSaraf/Practicals/PSDL/include/proc/pic16lf18444.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 01E9Ch
// bitfield definitions
T2INPPS_PIN_POSN                         equ 0000h
T2INPPS_PIN_POSITION                     equ 0000h
T2INPPS_PIN_SIZE                         equ 0003h
T2INPPS_PIN_LENGTH                       equ 0003h
T2INPPS_PIN_MASK                         equ 0007h
T2INPPS_PORT_POSN                        equ 0003h
T2INPPS_PORT_POSITION                    equ 0003h
T2INPPS_PORT_SIZE                        equ 0002h
T2INPPS_PORT_LENGTH                      equ 0002h
T2INPPS_PORT_MASK                        equ 0018h
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh
T2INPPS_T2INPPS0_POSN                    equ 0000h
T2INPPS_T2INPPS0_POSITION                equ 0000h
T2INPPS_T2INPPS0_SIZE                    equ 0001h
T2INPPS_T2INPPS0_LENGTH                  equ 0001h
T2INPPS_T2INPPS0_MASK                    equ 0001h
T2INPPS_T2INPPS1_POSN                    equ 0001h
T2INPPS_T2INPPS1_POSITION                equ 0001h
T2INPPS_T2INPPS1_SIZE                    equ 0001h
T2INPPS_T2INPPS1_LENGTH                  equ 0001h
T2INPPS_T2INPPS1_MASK                    equ 0002h
T2INPPS_T2INPPS2_POSN                    equ 0002h
T2INPPS_T2INPPS2_POSITION                equ 0002h
T2INPPS_T2INPPS2_SIZE                    equ 0001h
T2INPPS_T2INPPS2_LENGTH                  equ 0001h
T2INPPS_T2INPPS2_MASK                    equ 0004h
T2INPPS_T2INPPS3_POSN                    equ 0003h
T2INPPS_T2INPPS3_POSITION                equ 0003h
T2INPPS_T2INPPS3_SIZE                    equ 0001h
T2INPPS_T2INPPS3_LENGTH                  equ 0001h
T2INPPS_T2INPPS3_MASK                    equ 0008h
T2INPPS_T2INPPS4_POSN                    equ 0004h
T2INPPS_T2INPPS4_POSITION                equ 0004h
T2INPPS_T2INPPS4_SIZE                    equ 0001h
T2INPPS_T2INPPS4_LENGTH                  equ 0001h
T2INPPS_T2INPPS4_MASK                    equ 0010h

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 01E9Dh
// bitfield definitions
T4INPPS_PIN_POSN                         equ 0000h
T4INPPS_PIN_POSITION                     equ 0000h
T4INPPS_PIN_SIZE                         equ 0003h
T4INPPS_PIN_LENGTH                       equ 0003h
T4INPPS_PIN_MASK                         equ 0007h
T4INPPS_PORT_POSN                        equ 0003h
T4INPPS_PORT_POSITION                    equ 0003h
T4INPPS_PORT_SIZE                        equ 0002h
T4INPPS_PORT_LENGTH                      equ 0002h
T4INPPS_PORT_MASK                        equ 0018h
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh
T4INPPS_T4INPPS0_POSN                    equ 0000h
T4INPPS_T4INPPS0_POSITION                equ 0000h
T4INPPS_T4INPPS0_SIZE                    equ 0001h
T4INPPS_T4INPPS0_LENGTH                  equ 0001h
T4INPPS_T4INPPS0_MASK                    equ 0001h
T4INPPS_T4INPPS1_POSN                    equ 0001h
T4INPPS_T4INPPS1_POSITION                equ 0001h
T4INPPS_T4INPPS1_SIZE                    equ 0001h
T4INPPS_T4INPPS1_LENGTH                  equ 0001h
T4INPPS_T4INPPS1_MASK                    equ 0002h
T4INPPS_T4INPPS2_POSN                    equ 0002h
T4INPPS_T4INPPS2_POSITION                equ 0002h
T4INPPS_T4INPPS2_SIZE                    equ 0001h
T4INPPS_T4INPPS2_LENGTH                  equ 0001h
T4INPPS_T4INPPS2_MASK                    equ 0004h
T4INPPS_T4INPPS3_POSN                    equ 0003h
T4INPPS_T4INPPS3_POSITION                equ 0003h
T4INPPS_T4INPPS3_SIZE                    equ 0001h
T4INPPS_T4INPPS3_LENGTH                  equ 0001h
T4INPPS_T4INPPS3_MASK                    equ 0008h
T4INPPS_T4INPPS4_POSN                    equ 0004h
T4INPPS_T4INPPS4_POSITION                equ 0004h
T4INPPS_T4INPPS4_SIZE                    equ 0001h
T4INPPS_T4INPPS4_LENGTH                  equ 0001h
T4INPPS_T4INPPS4_MASK                    equ 0010h

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 01E9Eh
// bitfield definitions
T6INPPS_PIN_POSN                         equ 0000h
T6INPPS_PIN_POSITION                     equ 0000h
T6INPPS_PIN_SIZE                         equ 0003h
T6INPPS_PIN_LENGTH                       equ 0003h
T6INPPS_PIN_MASK                         equ 0007h
T6INPPS_PORT_POSN                        equ 0003h
T6INPPS_PORT_POSITION                    equ 0003h
T6INPPS_PORT_SIZE                        equ 0002h
T6INPPS_PORT_LENGTH                      equ 0002h
T6INPPS_PORT_MASK                        equ 0018h
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0005h
T6INPPS_T6INPPS_LENGTH                   equ 0005h
T6INPPS_T6INPPS_MASK                     equ 001Fh
T6INPPS_T6INPPS0_POSN                    equ 0000h
T6INPPS_T6INPPS0_POSITION                equ 0000h
T6INPPS_T6INPPS0_SIZE                    equ 0001h
T6INPPS_T6INPPS0_LENGTH                  equ 0001h
T6INPPS_T6INPPS0_MASK                    equ 0001h
T6INPPS_T6INPPS1_POSN                    equ 0001h
T6INPPS_T6INPPS1_POSITION                equ 0001h
T6INPPS_T6INPPS1_SIZE                    equ 0001h
T6INPPS_T6INPPS1_LENGTH                  equ 0001h
T6INPPS_T6INPPS1_MASK                    equ 0002h
T6INPPS_T6INPPS2_POSN                    equ 0002h
T6INPPS_T6INPPS2_POSITION                equ 0002h
T6INPPS_T6INPPS2_SIZE                    equ 0001h
T6INPPS_T6INPPS2_LENGTH                  equ 0001h
T6INPPS_T6INPPS2_MASK                    equ 0004h
T6INPPS_T6INPPS3_POSN                    equ 0003h
T6INPPS_T6INPPS3_POSITION                equ 0003h
T6INPPS_T6INPPS3_SIZE                    equ 0001h
T6INPPS_T6INPPS3_LENGTH                  equ 0001h
T6INPPS_T6INPPS3_MASK                    equ 0008h
T6INPPS_T6INPPS4_POSN                    equ 0004h
T6INPPS_T6INPPS4_POSITION                equ 0004h
T6INPPS_T6INPPS4_SIZE                    equ 0001h
T6INPPS_T6INPPS4_LENGTH                  equ 0001h
T6INPPS_T6INPPS4_MASK                    equ 0010h

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 01EA1h
// bitfield definitions
CCP1PPS_PIN_POSN                         equ 0000h
CCP1PPS_PIN_POSITION                     equ 0000h
CCP1PPS_PIN_SIZE                         equ 0003h
CCP1PPS_PIN_LENGTH                       equ 0003h
CCP1PPS_PIN_MASK                         equ 0007h
CCP1PPS_PORT_POSN                        equ 0003h
CCP1PPS_PORT_POSITION                    equ 0003h
CCP1PPS_PORT_SIZE                        equ 0002h
CCP1PPS_PORT_LENGTH                      equ 0002h
CCP1PPS_PORT_MASK                        equ 0018h
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 01EA2h
// bitfield definitions
CCP2PPS_PIN_POSN                         equ 0000h
CCP2PPS_PIN_POSITION                     equ 0000h
CCP2PPS_PIN_SIZE                         equ 0003h
CCP2PPS_PIN_LENGTH                       equ 0003h
CCP2PPS_PIN_MASK                         equ 0007h
CCP2PPS_PORT_POSN                        equ 0003h
CCP2PPS_PORT_POSITION                    equ 0003h
CCP2PPS_PORT_SIZE                        equ 0002h
CCP2PPS_PORT_LENGTH                      equ 0002h
CCP2PPS_PORT_MASK                        equ 0018h
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 01EA3h
// bitfield definitions
CCP3PPS_PIN_POSN                         equ 0000h
CCP3PPS_PIN_POSITION                     equ 0000h
CCP3PPS_PIN_SIZE                         equ 0003h
CCP3PPS_PIN_LENGTH                       equ 0003h
CCP3PPS_PIN_MASK                         equ 0007h
CCP3PPS_PORT_POSN                        equ 0003h
CCP3PPS_PORT_POSITION                    equ 0003h
CCP3PPS_PORT_SIZE                        equ 0002h
CCP3PPS_PORT_LENGTH                      equ 0002h
CCP3PPS_PORT_MASK                        equ 0018h
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0005h
CCP3PPS_CCP3PPS_LENGTH                   equ 0005h
CCP3PPS_CCP3PPS_MASK                     equ 001Fh
CCP3PPS_CCP3PPS0_POSN                    equ 0000h
CCP3PPS_CCP3PPS0_POSITION                equ 0000h
CCP3PPS_CCP3PPS0_SIZE                    equ 0001h
CCP3PPS_CCP3PPS0_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS0_MASK                    equ 0001h
CCP3PPS_CCP3PPS1_POSN                    equ 0001h
CCP3PPS_CCP3PPS1_POSITION                equ 0001h
CCP3PPS_CCP3PPS1_SIZE                    equ 0001h
CCP3PPS_CCP3PPS1_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS1_MASK                    equ 0002h
CCP3PPS_CCP3PPS2_POSN                    equ 0002h
CCP3PPS_CCP3PPS2_POSITION                equ 0002h
CCP3PPS_CCP3PPS2_SIZE                    equ 0001h
CCP3PPS_CCP3PPS2_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS2_MASK                    equ 0004h
CCP3PPS_CCP3PPS3_POSN                    equ 0003h
CCP3PPS_CCP3PPS3_POSITION                equ 0003h
CCP3PPS_CCP3PPS3_SIZE                    equ 0001h
CCP3PPS_CCP3PPS3_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS3_MASK                    equ 0008h
CCP3PPS_CCP3PPS4_POSN                    equ 0004h
CCP3PPS_CCP3PPS4_POSITION                equ 0004h
CCP3PPS_CCP3PPS4_SIZE                    equ 0001h
CCP3PPS_CCP3PPS4_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS4_MASK                    equ 0010h

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
CCP4PPS                                  equ 01EA4h
// bitfield definitions
CCP4PPS_PIN_POSN                         equ 0000h
CCP4PPS_PIN_POSITION                     equ 0000h
CCP4PPS_PIN_SIZE                         equ 0003h
CCP4PPS_PIN_LENGTH                       equ 0003h
CCP4PPS_PIN_MASK                         equ 0007h
CCP4PPS_PORT_POSN                        equ 0003h
CCP4PPS_PORT_POSITION                    equ 0003h
CCP4PPS_PORT_SIZE                        equ 0002h
CCP4PPS_PORT_LENGTH                      equ 0002h
CCP4PPS_PORT_MASK                        equ 0018h
CCP4PPS_CCP4PPS_POSN                     equ 0000h
CCP4PPS_CCP4PPS_POSITION                 equ 0000h
CCP4PPS_CCP4PPS_SIZE                     equ 0005h
CCP4PPS_CCP4PPS_LENGTH                   equ 0005h
CCP4PPS_CCP4PPS_MASK                     equ 001Fh
CCP4PPS_CCP4PPS0_POSN                    equ 0000h
CCP4PPS_CCP4PPS0_POSITION                equ 0000h
CCP4PPS_CCP4PPS0_SIZE                    equ 0001h
CCP4PPS_CCP4PPS0_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS0_MASK                    equ 0001h
CCP4PPS_CCP4PPS1_POSN                    equ 0001h
CCP4PPS_CCP4PPS1_POSITION                equ 0001h
CCP4PPS_CCP4PPS1_SIZE                    equ 0001h
CCP4PPS_CCP4PPS1_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS1_MASK                    equ 0002h
CCP4PPS_CCP4PPS2_POSN                    equ 0002h
CCP4PPS_CCP4PPS2_POSITION                equ 0002h
CCP4PPS_CCP4PPS2_SIZE                    equ 0001h
CCP4PPS_CCP4PPS2_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS2_MASK                    equ 0004h
CCP4PPS_CCP4PPS3_POSN                    equ 0003h
CCP4PPS_CCP4PPS3_POSITION                equ 0003h
CCP4PPS_CCP4PPS3_SIZE                    equ 0001h
CCP4PPS_CCP4PPS3_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS3_MASK                    equ 0008h
CCP4PPS_CCP4PPS4_POSN                    equ 0004h
CCP4PPS_CCP4PPS4_POSITION                equ 0004h
CCP4PPS_CCP4PPS4_SIZE                    equ 0001h
CCP4PPS_CCP4PPS4_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS4_MASK                    equ 0010h

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 01EA9h
// bitfield definitions
SMT1WINPPS_PIN_POSN                      equ 0000h
SMT1WINPPS_PIN_POSITION                  equ 0000h
SMT1WINPPS_PIN_SIZE                      equ 0003h
SMT1WINPPS_PIN_LENGTH                    equ 0003h
SMT1WINPPS_PIN_MASK                      equ 0007h
SMT1WINPPS_PORT_POSN                     equ 0003h
SMT1WINPPS_PORT_POSITION                 equ 0003h
SMT1WINPPS_PORT_SIZE                     equ 0002h
SMT1WINPPS_PORT_LENGTH                   equ 0002h
SMT1WINPPS_PORT_MASK                     equ 0018h
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0005h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0005h
SMT1WINPPS_SMT1WINPPS_MASK               equ 001Fh
SMT1WINPPS_SMT1WINPPS0_POSN              equ 0000h
SMT1WINPPS_SMT1WINPPS0_POSITION          equ 0000h
SMT1WINPPS_SMT1WINPPS0_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS0_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS0_MASK              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSN              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSITION          equ 0001h
SMT1WINPPS_SMT1WINPPS1_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS1_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS1_MASK              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSN              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSITION          equ 0002h
SMT1WINPPS_SMT1WINPPS2_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS2_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS2_MASK              equ 0004h
SMT1WINPPS_SMT1WINPPS3_POSN              equ 0003h
SMT1WINPPS_SMT1WINPPS3_POSITION          equ 0003h
SMT1WINPPS_SMT1WINPPS3_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS3_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS3_MASK              equ 0008h
SMT1WINPPS_SMT1WINPPS4_POSN              equ 0004h
SMT1WINPPS_SMT1WINPPS4_POSITION          equ 0004h
SMT1WINPPS_SMT1WINPPS4_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS4_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS4_MASK              equ 0010h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 01EAAh
// bitfield definitions
SMT1SIGPPS_PIN_POSN                      equ 0000h
SMT1SIGPPS_PIN_POSITION                  equ 0000h
SMT1SIGPPS_PIN_SIZE                      equ 0003h
SMT1SIGPPS_PIN_LENGTH                    equ 0003h
SMT1SIGPPS_PIN_MASK                      equ 0007h
SMT1SIGPPS_PORT_POSN                     equ 0003h
SMT1SIGPPS_PORT_POSITION                 equ 0003h
SMT1SIGPPS_PORT_SIZE                     equ 0002h
SMT1SIGPPS_PORT_LENGTH                   equ 0002h
SMT1SIGPPS_PORT_MASK                     equ 0018h
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0005h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0005h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 001Fh
SMT1SIGPPS_SMT1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMT1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMT1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_MASK              equ 0010h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 01EB1h
// bitfield definitions
CWG1PPS_PIN_POSN                         equ 0000h
CWG1PPS_PIN_POSITION                     equ 0000h
CWG1PPS_PIN_SIZE                         equ 0003h
CWG1PPS_PIN_LENGTH                       equ 0003h
CWG1PPS_PIN_MASK                         equ 0007h
CWG1PPS_PORT_POSN                        equ 0003h
CWG1PPS_PORT_POSITION                    equ 0003h
CWG1PPS_PORT_SIZE                        equ 0002h
CWG1PPS_PORT_LENGTH                      equ 0002h
CWG1PPS_PORT_MASK                        equ 0018h
CWG1PPS_CWG1PPS_POSN                     equ 0000h
CWG1PPS_CWG1PPS_POSITION                 equ 0000h
CWG1PPS_CWG1PPS_SIZE                     equ 0005h
CWG1PPS_CWG1PPS_LENGTH                   equ 0005h
CWG1PPS_CWG1PPS_MASK                     equ 001Fh
CWG1PPS_CWG1PPS0_POSN                    equ 0000h
CWG1PPS_CWG1PPS0_POSITION                equ 0000h
CWG1PPS_CWG1PPS0_SIZE                    equ 0001h
CWG1PPS_CWG1PPS0_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS0_MASK                    equ 0001h
CWG1PPS_CWG1PPS1_POSN                    equ 0001h
CWG1PPS_CWG1PPS1_POSITION                equ 0001h
CWG1PPS_CWG1PPS1_SIZE                    equ 0001h
CWG1PPS_CWG1PPS1_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS1_MASK                    equ 0002h
CWG1PPS_CWG1PPS2_POSN                    equ 0002h
CWG1PPS_CWG1PPS2_POSITION                equ 0002h
CWG1PPS_CWG1PPS2_SIZE                    equ 0001h
CWG1PPS_CWG1PPS2_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS2_MASK                    equ 0004h
CWG1PPS_CWG1PPS3_POSN                    equ 0003h
CWG1PPS_CWG1PPS3_POSITION                equ 0003h
CWG1PPS_CWG1PPS3_SIZE                    equ 0001h
CWG1PPS_CWG1PPS3_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS3_MASK                    equ 0008h
CWG1PPS_CWG1PPS4_POSN                    equ 0004h
CWG1PPS_CWG1PPS4_POSITION                equ 0004h
CWG1PPS_CWG1PPS4_SIZE                    equ 0001h
CWG1PPS_CWG1PPS4_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS4_MASK                    equ 0010h

